rework-request-sample.conf

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proj="http://amdocs.com/oss/aff/schema/projectStoreElements" xmlns:proj1="http://amdocs.com/oss/aff/schema/project">
 	   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-PFVFTT5LPTxrZXk+LnN5c3RlbS5lbnYuZW5jcnlwdGlvbi4wO0M9MTYyODI0NzEzMTkxMTtNPUVqR0ZNezhmWXRXdXVWWTJlV0kyfVNsVnYwbUJWamZvRERiNUdXcHRpNmNqRTlJbTZwdXN3dmhIcjhBM2NRSGhIZ3BEYXZ5SVR7VmsyeWtCamREWUcyMjs8L1VFTT4=">
            <wsse:Username>AFFSuper</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
            reworkProjectRequestToken
           </wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <proj:reworkProject>
         <proj:reworkProjectRequest>
            <proj:project>
               <proj1:projectID>reworkProjectRequestProjectId</proj1:projectID>
               <proj1:reason>
                  <proj1:code>reworkProjectRequestReasonCode</proj1:code>
                  <proj1:comments>reworkProjectRequestReasonComments</proj1:comments>
               </proj1:reason>
            </proj:project>
         </proj:reworkProjectRequest>
      </proj:reworkProject>
   </soapenv:Body>
</soapenv:Envelope>